uhnp/src/InformationRegisters/НастройкаПодтвержденияЗакупки/НастройкаПодтвержденияЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПодтвержденияЗакупки</name>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КатегорииЗакупок</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкаПодтвержденияЗакупки/Forms/ФормаПодбора/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент) 
	ОбновитьТаблицыДанныхНаКлиенте();	
КонецПроцедуры     

&НаКлиенте
Процедура ОбновитьТаблицыДанныхНаКлиенте()
	Если Модифицированность Тогда
		
		Оповещение 		= Новый ОписаниеОповещения("ПрименитьИзмененияНаФорме", ЭтотОбъект);
		ТекстВопроса  	= НСтр("ru = 'На форме имеются изменения. Продолжить и сохранить? '");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет,
							НСтр("ru = 'Сохранение изменений'"));
		Возврат;	
	КонецЕсли;
	ОбновитьТаблицыДанных();	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияНаФорме(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьЗаписиНаСервере();
	КонецЕсли;
    Модифицированность = Ложь;
	ОбновитьТаблицыДанных();	
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	ОбновитьТаблицыДанныхНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  
&НаКлиенте
Процедура ВыбратьСоздать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""ЦФО""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ЦФО");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""Периодичность""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Периодичность");
		Возврат;
	КонецЕсли;

	СоздатьЗаписиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВлево(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""ЦФО""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ЦФО");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""Периодичность""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Периодичность");
		Возврат;
	КонецЕсли;

    Модифицированность = Истина;
	
	ТекущиеДанныеТаблицы = Элементы.ТаблицаВыбранная.ВыделенныеСтроки;
	
	Если НЕ ТекущиеДанныеТаблицы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСтрок = ТекущиеДанныеТаблицы.Количество();
    Пока КоличествоСтрок  > 0 Цикл
        НайденнаяСтрока = ТаблицаВыбранная.НайтиПоИдентификатору(ТекущиеДанныеТаблицы[КоличествоСтрок-1]);
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;		
		КонецЕсли;		
		СтрокаТаблицаВыбранная = ТаблицаДоступная.Добавить();
		СтрокаТаблицаВыбранная.Номенклатура 	= НайденнаяСтрока.Номенклатура;		
		СтрокаТаблицаВыбранная.ПризнакИзменить 	= Истина;
		СтрокаТаблицаВыбранная.Периодичность 	= Периодичность;
        ТаблицаВыбранная.Удалить(НайденнаяСтрока);  
		
		КоличествоСтрок = КоличествоСтрок -1;
    КонецЦикла; 

	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВправо(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""ЦФО""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ЦФО");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		ТекстСообщения  = НСтр("ru = 'Необходимо перед записью выбрать ""Периодичность""'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Периодичность");
		Возврат;
	КонецЕсли;
    
	Модифицированность = Истина;
	
	ТекущиеДанныеТаблицы = Элементы.ТаблицаДоступная.ВыделенныеСтроки;
	
	Если НЕ ТекущиеДанныеТаблицы.Количество() Тогда
		Возврат;
	КонецЕсли;

    КоличествоСтрок = ТекущиеДанныеТаблицы.Количество();
    Пока КоличествоСтрок  > 0 Цикл
        НайденнаяСтрока = ТаблицаДоступная.НайтиПоИдентификатору(ТекущиеДанныеТаблицы[КоличествоСтрок-1]);
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;		
		КонецЕсли;		
		СтрокаТаблицаВыбранная = ТаблицаВыбранная.Добавить();
		СтрокаТаблицаВыбранная.Номенклатура 	= НайденнаяСтрока.Номенклатура;		
		СтрокаТаблицаВыбранная.ПризнакИзменить 	= Истина;	
		СтрокаТаблицаВыбранная.Периодичность 	= Периодичность;
        ТаблицаДоступная.Удалить(НайденнаяСтрока); 
		КоличествоСтрок = КоличествоСтрок -1;
    КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	Для каждого СтрокаТаблицаДоступная Из ТаблицаДоступная Цикл
		
		Если НЕ СтрокаТаблицаДоступная.ПризнакИзменить Тогда
			Продолжить;		
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.НастройкаПодтвержденияЗакупки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицаДоступная.Номенклатура);
		НаборЗаписей.Отбор.ЦФО.Установить(ЦФО);
				
		НаборЗаписей.Записать();
		
	КонецЦикла; 
	
	Для каждого СтрокаТаблицаВыбранная Из ТаблицаВыбранная Цикл
		
		Если НЕ СтрокаТаблицаВыбранная.ПризнакИзменить Тогда
			Продолжить;		
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.НастройкаПодтвержденияЗакупки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура  = СтрокаТаблицаВыбранная.Номенклатура;
		МенеджерЗаписи.ЦФО			 = ЦФО;
		МенеджерЗаписи.Периодичность = СтрокаТаблицаВыбранная.Периодичность;
		
		МенеджерЗаписи.Записать();
	
	КонецЦикла; 
	Модифицированность = Ложь;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицыДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварныеКатегории.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.КатегорииЗакупок КАК ТоварныеКатегории
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ПО (НастройкаПодтвержденияЗакупки.Номенклатура = ТоварныеКатегории.Ссылка)
		|			И (НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО)
		|ГДЕ
		|	НастройкаПодтвержденияЗакупки.ЦФО ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварныеКатегории.Наименование";
	Запрос.УстановитьПараметр("ЦФО", 			ЦФО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаДоступная.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДоступная.Добавить(), ВыборкаДетальныеЗаписи);		
	КонецЦикла; 
	
	
	// Заполняем  таблицу выбранных позиций 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварныеКатегории.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.КатегорииЗакупок КАК ТоварныеКатегории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПодтвержденияЗакупки КАК НастройкаПодтвержденияЗакупки
		|		ПО (НастройкаПодтвержденияЗакупки.Номенклатура = ТоварныеКатегории.Ссылка)
		|			И (НастройкаПодтвержденияЗакупки.ЦФО = &ЦФО)
		|			И (НастройкаПодтвержденияЗакупки.Периодичность = &Периодичность)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварныеКатегории.Наименование";
	Запрос.УстановитьПараметр("ЦФО", 			ЦФО);
	Запрос.УстановитьПараметр("Периодичность", 	Периодичность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаВыбранная.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаВыбранная.Добавить(), ВыборкаДетальныеЗаписи);		
	КонецЦикла; 
 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоступнаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПереместитьВправо(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбраннаяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПереместитьВлево(Неопределено);
КонецПроцедуры

#КонецОбласти
